In [2]:
import pandas as pd
import numpy as np
import matplotlib as plt

In [13]:
columns=['name','age','gender','job']
user1=pd.DataFrame([["alice",19,"F","student"],["john",26,"M","student"]],columns=columns)
print (user1)
print("\n")
user2=pd.DataFrame([["eric",19,"M","student"],["paul",26,"M","manager"]],columns=columns)
print (user2)

    name  age gender      job
0  alice   19      F  student
1   john   26      M  student


   name  age gender      job
0  eric   19      M  student
1  paul   26      M  manager

In [6]:
user3=pd.DataFrame(dict(name=['peter','julie'],age=[30,35],gender=["m","f"],job=["manager","engineer"]),columns=columns)
print (user3)

    name  age gender       job
0  peter   30      m   manager
1  julie   35      f  engineer

In [10]:
print (user1.append(user3))

    name  age gender       job
0  alice   19      F   student
1   john   26      M   student
0  peter   30      m   manager
1  julie   35      f  engineer

In [14]:
users=pd.concat([user1,user2,user3])
print (users)

    name  age gender       job
0  alice   19      F   student
1   john   26      M   student
0   eric   19      M   student
1   paul   26      M   manager
0  peter   30      m   manager
1  julie   35      f  engineer

In [20]:
user4=pd.DataFrame(dict(name=['alice','john','eric','julie'],height=[165,180,175,171]))
print (user4)

   height   name
0     165  alice
1     180   john
2     175   eric
3     171  julie

In [18]:
merge_inner=pd.merge(users,user4,on="name")
print(merge_inner)

    name  age gender      job  height
0  alice   19      F  student     165
1   john   26      M  student     180
2   eric   19      M  student     175

In [21]:
merge_outer=pd.merge(users,user4,on="name",how="outer")
print(merge_outer)

    name  age gender       job  height
0  alice   19      F   student   165.0
1   john   26      M   student   180.0
2   eric   19      M   student   175.0
3   paul   26      M   manager     NaN
4  peter   30      m   manager     NaN
5  julie   35      f  engineer   171.0

In [22]:
merge_inner=pd.merge(users,user4,on="name",how="inner") #by default inner
print(merge_inner)

    name  age gender       job  height
0  alice   19      F   student     165
1   john   26      M   student     180
2   eric   19      M   student     175
3  julie   35      f  engineer     171

In [23]:
print (users)       #print first 30 and last 30 rows
print("type(users))
print(users.head()) #print first 5 rows
print(users.tail()) #print last 5 rows
users.describe()    #summarize all numeric columns

    name  age gender       job
0  alice   19      F   student
1   john   26      M   student
0   eric   19      M   student
1   paul   26      M   manager
0  peter   30      m   manager
1  julie   35      f  engineer
<class 'pandas.core.frame.DataFrame'>
    name  age gender      job
0  alice   19      F  student
1   john   26      M  student
0   eric   19      M  student
1   paul   26      M  manager
0  peter   30      m  manager
    name  age gender       job
1   john   26      M   student
0   eric   19      M   student
1   paul   26      M   manager
0  peter   30      m   manager
1  julie   35      f  engineer

             age
count   6.000000
mean   25.833333
std     6.242329
min    19.000000
25%    20.750000
50%    26.000000
75%    29.000000
max    35.000000

In [30]:
print(users.index)
print("\n")
print(users.columns)
print("\n")
print(users.dtypes)
print("\n")
print(users.shape)
print("\n")
print(users.info())

Int64Index([0, 1, 0, 1, 0, 1], dtype='int64')


Index(['name', 'age', 'gender', 'job'], dtype='object')


name      object
age        int64
gender    object
job       object
dtype: object


(6, 4)


<class 'pandas.core.frame.DataFrame'>
Int64Index: 6 entries, 0 to 1
Data columns (total 4 columns):
name      6 non-null object
age       6 non-null int64
gender    6 non-null object
job       6 non-null object
dtypes: int64(1), object(3)
memory usage: 168.0+ bytes
None

In [31]:
users.describe(include=["object"])

        name gender      job
count      6      6        6
unique     6      4        3
top     eric      M  student
freq       1      3        3

In [35]:

#column selection
users["gender"]

0    F
1    M
0    M
1    M
0    m
1    f
Name: gender, dtype: object

In [33]:
users.gender

0    F
1    M
0    M
1    M
0    m
1    f
Name: gender, dtype: object

In [36]:
users[["name","gender"]]

    name gender
0  alice      F
1   john      M
0   eric      M
1   paul      M
0  peter      m
1  julie      f

In [38]:
my_col=["age","gender"]
print(users[my_col])
type(users[my_col])

   age gender
0   19      F
1   26      M
0   19      M
1   26      M
0   30      m
1   35      f

pandas.core.frame.DataFrame

In [40]:
df=users.copy()
print(df.iloc[0])
print("\n")
print(df.iloc[0,0])

name        alice
age            19
gender          F
job       student
Name: 0, dtype: object


alice

In [50]:
df=users.copy()
print(df)
df.iloc[0,1]=55
print(df)

    name  age gender       job
0  alice   19      F   student
1   john   26      M   student
0   eric   19      M   student
1   paul   26      M   manager
0  peter   30      m   manager
1  julie   35      f  engineer
    name  age gender       job
0  alice   55      F   student
1   john   26      M   student
0   eric   19      M   student
1   paul   26      M   manager
0  peter   30      m   manager
1  julie   35      f  engineer

In [51]:
check=users.age<25
print(check)

0     True
1    False
0     True
1    False
0    False
1    False
Name: age, dtype: bool

In [52]:
users[check]

    name  age gender      job
0  alice   19      F  student
0   eric   19      M  student

In [56]:
df.age.sort_values()

0    19
1    26
1    26
0    30
1    35
0    55
Name: age, dtype: int64

In [57]:
df.sort_values(by="age")

    name  age gender       job
0   eric   19      M   student
1   john   26      M   student
1   paul   26      M   manager
0  peter   30      m   manager
1  julie   35      f  engineer
0  alice   55      F   student

In [58]:
df.sort_values(by="age",ascending=False)

    name  age gender       job
0  alice   55      F   student
1  julie   35      f  engineer
0  peter   30      m   manager
1   john   26      M   student
1   paul   26      M   manager
0   eric   19      M   student

In [60]:
#Reshaping by Pivoting
stacked=pd.melt(users,id_vars="name",var_name="category",value_name="value")
print(stacked)

     name category     value
0   alice      age        19
1    john      age        26
2    eric      age        19
3    paul      age        26
4   peter      age        30
5   julie      age        35
6   alice   gender         F
7    john   gender         M
8    eric   gender         M
9    paul   gender         M
10  peter   gender         m
11  julie   gender         f
12  alice      job   student
13   john      job   student
14   eric      job   student
15   paul      job   manager
16  peter      job   manager
17  julie      job  engineer

In [63]:
#quality control: duplicate data
df=users.append(df.iloc[0],ignore_index=True)
df

    name  age gender       job
0  alice   19      F   student
1   john   26      M   student
2   eric   19      M   student
3   paul   26      M   manager
4  peter   30      m   manager
5  julie   35      f  engineer
6  alice   19      F   student

In [65]:
df.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [66]:
df[df.duplicated()]

    name  age gender      job
6  alice   19      F  student

In [68]:
df[df.duplicated(["gender"])]

    name  age gender      job
2   eric   19      M  student
3   paul   26      M  manager
6  alice   19      F  student

In [70]:
df=df.drop_duplicates()
df

    name  age gender       job
0  alice   19      F   student
1   john   26      M   student
2   eric   19      M   student
3   paul   26      M   manager
4  peter   30      m   manager
5  julie   35      f  engineer

In [71]:
df=users.copy()
df.describe(include="all")

        name        age gender      job
count      6   6.000000      6        6
unique     6        NaN      4        3
top     eric        NaN      M  student
freq       1        NaN      3        3
mean     NaN  25.833333    NaN      NaN
std      NaN   6.242329    NaN      NaN
min      NaN  19.000000    NaN      NaN
25%      NaN  20.750000    NaN      NaN
50%      NaN  26.000000    NaN      NaN
75%      NaN  29.000000    NaN      NaN
max      NaN  35.000000    NaN      NaN

In [77]:
df1=df.describe(include="all")
print(df1.job.isnull())
df1

count     False
unique    False
top       False
freq      False
mean       True
std        True
min        True
25%        True
50%        True
75%        True
max        True
Name: job, dtype: bool

        name        age gender      job
count      6   6.000000      6        6
unique     6        NaN      4        3
top     eric        NaN      M  student
freq       1        NaN      3        3
mean     NaN  25.833333    NaN      NaN
std      NaN   6.242329    NaN      NaN
min      NaN  19.000000    NaN      NaN
25%      NaN  20.750000    NaN      NaN
50%      NaN  26.000000    NaN      NaN
75%      NaN  29.000000    NaN      NaN
max      NaN  35.000000    NaN      NaN

In [78]:
df1.dropna() #Delete rows having some not availabel values. the rest is displayed

      name  age gender job
count    6  6.0      6   6